Repository: liuzeyi11/GovernmentWorkReportCorpus
Catalog: government_report_tmx_file/GR2012.tmx
Source language: en_us
Languages: zh_cn

source: In the new year, China's diplomacy should better promote the country's over-arching goal of promoting reform, opening up, and socialist modernization; and make greater contributions to global economic growth and world peace and stability.
zh_cn: 新的一年，外交工作要更好地服务于改革开放和社会主义现代化建设大局，为促进世界经济增长、维护和平稳定作出更大贡献。

source: We will continue to deepen friendly relations with our neighbors; actively participate in cooperation mechanisms with them; deepen regional cooperation; and work with them in creating a regional environment of peace, stability, equality, mutual trust, cooperation, and mutual benefit.
zh_cn: 我们将继续深化同周边国家的睦邻友好关系，积极参与周边各种合作机制，推动区域合作深入发展，共同营造和平稳定、平等互信、合作共赢的地区环境。

source: We will enhance unity and cooperation with other developing countries, deepen traditional friendships, expand mutually beneficial cooperation, help achieve the UN Millennium Development Goals, and uphold the legitimate rights and interests as well as the common interests of developing countries.
zh_cn: 我们将与广大发展中国家加强团结合作，深化传统友谊，扩大互利合作，推动实现联合国千年发展目标，维护发展中国家的正当权益和共同利益。

source: We will increase strategic dialogue with other major countries to promote strategic mutual trust, broaden areas of cooperation, and promote the long-term, steady, and sound growth of our relations with them.
zh_cn: 我们将加强与各大国的战略对话，增进战略互信，拓展合作领域，推进相互关系长期稳定健康发展。

source: We will actively participate in multilateral affairs and global governance and contribute to making the international political and economic order more just and equitable.
zh_cn: 我们将积极参与多边事务和全球治理，推动国际秩序朝着更加公正合理的方向发展。

source: We will adhere to the path of peaceful development, continue to pursue an independent foreign policy of peace, and follow an open strategy of mutual benefit. We will work tirelessly with other countries to advance human civilization, improve the wellbeing of people in all countries, and build a harmonious world of enduring peace and common prosperity.
zh_cn: 我们将坚定不移地走和平发展道路，坚持独立自主的和平外交政策，奉行互利共赢的开放战略，同世界各国一道，为促进人类文明进步，增进各国人民的福祉和建设一个持久和平、共同繁荣的和谐世界而不懈努力！

source: In the past, we have achieved remarkable progress through hard work. In the future, we must continue to work tirelessly to accomplish the important tasks on the road ahead.
zh_cn: 回顾过去，我们拼搏奋进，取得显著成就；展望未来，我们任重道远，仍须不懈努力。

source: Let all of us rally closely around the Party Central Committee with Comrade Hu Jintao as General Secretary, free our minds, forge ahead in the spirit of innovation, make solid progress in our work, and strive to further advance socialist modernization.
zh_cn: 让我们紧密团结在以胡锦涛同志为总书记的党中央周围，解放思想，开拓创新，扎实工作，奋力开创社会主义现代化建设新局面！
